"""
Логикалық операторлар — екі немесе одан да көп мәндерді салыстырып, нәтижені логикалық тұрғыдан
анықтауға арналған операторлар.
Python-да негізгі логикалық операторлар:

and — барлық шарттар дұрыс болғанда (True) нәтиже де True болады.
or — шарттардың біреуі дұрыс болса да нәтиже True болады.
not — шартты теріске шығарады (True-ды False-қа және керісінше өзгертеді)
"""


# 'and' операторы
x = 7
y = 3
result = (x < 5) and (y > 10)
print("Шарт орындалды:", result)

# 'or' операторы
x = 4
y = 12
result = (x > 5) or (y < 15)#False or True
print("Бір шарт орындалды:", result)

# 'not' операторы
x = 8
result = not(x < 10)
print("Шарт дұрыс емес:", result)

#Оқушыдан үш санды енгізіп, олардың барлығы оң сан ба, жоқ па, тексеріңіз

# san3 = int(input("san engiz"))
#
# if san1 > 0 and san2 > 0 and san3 > 0:
#     print(True)
# else:
#     print(False)
#Екі санның кем дегенде біреуі нөл екенін тексеру қажет
san1 = int(input("san engiz"))
san2 = int(input("san engiz"))
#
# if san1 == 0 or san2 == 0:
#     print(True)
# else:
#     print(False)

#Теңдеу арқылы екі мәннің дұрыс екенін анықтаңыз: x және y енгізіп, 𝑥 + 𝑦 = 10 шартын тексеріңіз.
