# Кірістірілген шарттар деп шарт ішінде шарт болған кезді айтамыз

"""
Банктен кредит алу үшін адамның жасы және табысы маңызды. Егер адамның жасы 21-ден жоғары болса,
онда оның табысы тексеріледі. Егер табысы 500,000 тенгеден асса, онда кредит беріледі,
ал табыс жеткіліксіз болса, кредит берілмейді. Ал егер жасы 21-ден төмен болса, кредит берілмейді
"""
zhasy = int(input("Жасың қаншада?"))
tabys = int(input("Табысың қанша?"))

if zhasy > 21:
    if tabys > 500000:
        print("Кредит ал/ Одобрено")
    else:
        print("Отказано")
else:
    print("Отказано")


"""
Егер сіздің интернет трафигіңіз 10 ГБ-тан көп болса және ай сайынғы сөйлесу уақытыңыз 200 минуттан асса, 
онда сізге «Премиум» тарифі ұсынылады. Егер тек интернет трафигіңіз 10 ГБ-тан көп болса, 
бірақ сөйлесу уақытыңыз жеткіліксіз болса, «Стандарт» тарифі ұсынылады. 
Ал егер интернет трафигіңіз 10 ГБ-тан аз болса, сізге «Базалық» тариф ұсынылады
"""
